[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:22:30
 
   const testIdPrefix = "UCSBDiningCommonsMenuItemForm";
 
-  const nonBlankValidation = (fieldName) => ({
-    required: `${fieldName} is required.`,
-    validate: (value) =>
-      value.trim().length > 0 || `${fieldName} cannot be blank.`,
-  });
+  const nonBlankValidation = () => undefined;
 
   return (
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Dining Commons Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:24:15
 
   const nonBlankValidation = (fieldName) => ({
     required: `${fieldName} is required.`,
-    validate: (value) =>
-      value.trim().length > 0 || `${fieldName} cannot be blank.`,
+    validate: () => undefined,
   });
 
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Dining Commons Code cannot be blank/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:25:7
   const nonBlankValidation = (fieldName) => ({
     required: `${fieldName} is required.`,
     validate: (value) =>
-      value.trim().length > 0 || `${fieldName} cannot be blank.`,
+      value.trim().length >= 0 || `${fieldName} cannot be blank.`,
   });
 
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Dining Commons Code cannot be blank/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:25:7
   const nonBlankValidation = (fieldName) => ({
     required: `${fieldName} is required.`,
     validate: (value) =>
-      value.trim().length > 0 || `${fieldName} cannot be blank.`,
+      value.trim().length > 0 && `${fieldName} cannot be blank.`,
   });
 
killedBy: UCSBDiningCommonsMenuItemForm tests submitAction is called with form data when valid data is submitted
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) }, Anything ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:52:13
           type="text"
           isInvalid={Boolean(errors.diningCommonsCode)}
           {...register(
-            "diningCommonsCode",
+            "",
             nonBlankValidation("Dining Commons Code"),
           )}
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
