[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:19:45
     navigate(`/diningcommonsmenuitem/edit/${cell.row.original.id}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => {
-    return {
-      url: "/api/UCSBDiningCommonsMenuItem",
-      method: "DELETE",
-      params: {
-        id: cell.row.original.id,
-      },
-    };
-  };
+  const cellToAxiosParamsDelete = (cell) => {};
 
   const onDeleteSuccess = (message) => {
killedBy: UCSBDiningCommonsMenuItemIndexPage tests what happens when you click delete, admin
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:29:40
     };
   };
 
-  const onDeleteSuccess = (message) => {
-    console.log(message);
-  };
+  const onDeleteSuccess = (message) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Delete button calls delete callback
statusReason: expected "log" to be called at least once
