[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/UCSBDiningCommonsMenuItem/all"],
-    { method: "GET", url: "/api/UCSBDiningCommonsMenuItem/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
