[Killed] ObjectLiteral
src/main/fixtures/ucsbDiningCommonsMenuItemFixtures.js:2:33
 const ucsbDiningCommonsMenuItemFixtures = {
-  oneUCSBDiningCommonsMenuItem: {
-    id: 1,
-    diningCommonsCode: "dlg",
-    name: "Spaghetti",
-    station: "Entree",
-  },
+  oneUCSBDiningCommonsMenuItem: {},
 
   threeUCSBDiningCommonsMenuItems: [
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:

[Killed] StringLiteral
src/main/fixtures/ucsbDiningCommonsMenuItemFixtures.js:5:11
   oneUCSBDiningCommonsMenuItem: {
     id: 1,
     diningCommonsCode: "dlg",
-    name: "Spaghetti",
+    name: "",
     station: "Entree",
   },
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(Spaghetti)

Expected the element to have value:
  Spaghetti
Received:

[Killed] ObjectLiteral
src/main/fixtures/ucsbDiningCommonsMenuItemFixtures.js:10:5
   },
 
   threeUCSBDiningCommonsMenuItems: [
-    {
-      id: 1,
-      diningCommonsCode: "dlg",
-      name: "Spaghetti",
-      station: "Entree",
-    },
+    {},
 
     {
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
src/main/fixtures/ucsbDiningCommonsMenuItemFixtures.js:19:26
 
     {
       id: 2,
-      diningCommonsCode: "ortega",
+      diningCommonsCode: "",
       name: "Chicken Tacos",
       station: "Grill",
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: Unable to find an element with the text: ortega. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/fixtures/ucsbDiningCommonsMenuItemFixtures.js:24:5
       station: "Grill",
     },
 
-    {
-      id: 3,
-      diningCommonsCode: "carrillo",
-      name: "Caesar Salad",
-      station: "Salad Bar",
-    },
+    {},
   ],
 };
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
