[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.jsx:61:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "requestTime is required. "}
+              {errors.requestTime || "requestTime is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester's Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:78:28
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Requester's Email is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Max Email length is 255 characters",
-                },
+                maxLength: {},
               })}
             />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max Email length is 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:121:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "Table or Breakout Room is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Table or Breakout Room is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
