[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (request) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: request.requesterEmail,
-      teamId: request.teamId,
-      tableOrBreakoutRoom: request.tableOrBreakoutRoom,
-      explanation: request.explanation,
-      solved: request.solved,
-      requestTime: request.requestTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (request) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:21:34
     },
   });
 
-  const onSuccess = (request) => {
-    toast(
-      `New Help Request Created - id: ${request.id} requester: ${request.requesterEmail}`,
-    );
-  };
+  const onSuccess = (request) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
