[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:54:23
           type="text"
           isInvalid={Boolean(errors.itemId)}
           {...register("itemId", {
-            required: "Item Id is required",
+            required: "",
             maxLength: {
               value: 18,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:57:24
             required: "Item Id is required",
             maxLength: {
               value: 18,
-              message: "Max length 18 characters",
+              message: "",
             },
           })}
killedBy: MenuItemReviewForm tests for max itemid length
statusReason: Unable to find an element with the text: /Max length 18 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:73:41
           id="reviewerEmail"
           type="text"
           isInvalid={Boolean(errors.reviewerEmail)}
-          {...register("reviewerEmail", {
-            required: "Reviewer Email is required",
-          })}
+          {...register("reviewerEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:91:18
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
             required: "Stars is required",
-            min: {
-              value: 1,
-              message: "Stars must be at least 1",
-            },
+            min: {},
             max: {
               value: 5,
killedBy: MenuItemReviewForm tests for star min/max values
statusReason: Unable to find an element with the text: /Stars must be at least 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:93:24
             required: "Stars is required",
             min: {
               value: 1,
-              message: "Stars must be at least 1",
+              message: "",
             },
             max: {
killedBy: MenuItemReviewForm tests for star min/max values
statusReason: Unable to find an element with the text: /Stars must be at least 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:119:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateReviewed && "Date Reviewed is required"}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.jsx:119:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateReviewed && "Date Reviewed is required"}
+          {errors.dateReviewed || "Date Reviewed is required"}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
