[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:2:29
 const recommendationRequestFixtures = {
-  oneRecommendationRequest: {
-    id: 1,
-    requesterEmail: "student@ucsb.edu",
-    professorEmail: "professor@ucsb.edu",
-    explanation:
-      "I am applying for a summer internship and need a recommendation letter.",
-    dateRequested: "2026-05-05T14:00:00",
-    dateNeeded: "2026-06-01T17:00:00",
-    done: false,
-  },
+  oneRecommendationRequest: {},
   threeRecommendationRequests: [
     {
killedBy: recommendationRequestFixtures has expected oneRecommendationRequest
statusReason: expected {} to deeply equal { id: 1, …(6) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:7:7
     requesterEmail: "student@ucsb.edu",
     professorEmail: "professor@ucsb.edu",
     explanation:
-      "I am applying for a summer internship and need a recommendation letter.",
+      "",
     dateRequested: "2026-05-05T14:00:00",
     dateNeeded: "2026-06-01T17:00:00",
killedBy: recommendationRequestFixtures has expected oneRecommendationRequest
statusReason: expected { id: 1, …(6) } to deeply equal { id: 1, …(6) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:8:20
     professorEmail: "professor@ucsb.edu",
     explanation:
       "I am applying for a summer internship and need a recommendation letter.",
-    dateRequested: "2026-05-05T14:00:00",
+    dateRequested: "",
     dateNeeded: "2026-06-01T17:00:00",
     done: false,
killedBy: recommendationRequestFixtures has expected oneRecommendationRequest
statusReason: expected { id: 1, …(6) } to deeply equal { id: 1, …(6) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:9:17
     explanation:
       "I am applying for a summer internship and need a recommendation letter.",
     dateRequested: "2026-05-05T14:00:00",
-    dateNeeded: "2026-06-01T17:00:00",
+    dateNeeded: "",
     done: false,
   },
killedBy: recommendationRequestFixtures has expected oneRecommendationRequest
statusReason: expected { id: 1, …(6) } to deeply equal { id: 1, …(6) }

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:10:11
       "I am applying for a summer internship and need a recommendation letter.",
     dateRequested: "2026-05-05T14:00:00",
     dateNeeded: "2026-06-01T17:00:00",
-    done: false,
+    done: true,
   },
   threeRecommendationRequests: [
killedBy: recommendationRequestFixtures has expected oneRecommendationRequest
statusReason: expected { id: 1, …(6) } to deeply equal { id: 1, …(6) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:18:22
       requesterEmail: "student1@ucsb.edu",
       professorEmail: "professor1@ucsb.edu",
       explanation: "I am applying for graduate school.",
-      dateRequested: "2026-05-01T09:00:00",
+      dateRequested: "",
       dateNeeded: "2026-06-01T17:00:00",
       done: false,
killedBy: recommendationRequestFixtures has expected threeRecommendationRequests
statusReason: expected [ { id: 1, …(6) }, …(2) ] to deeply equal [ { id: 1, …(6) }, …(2) ]

[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:22:5
       dateNeeded: "2026-06-01T17:00:00",
       done: false,
     },
-    {
-      id: 2,
-      requesterEmail: "student2@ucsb.edu",
-      professorEmail: "professor2@ucsb.edu",
-      explanation: "I need a letter for a scholarship application.",
-      dateRequested: "2026-05-02T10:30:00",
-      dateNeeded: "2026-05-20T23:59:00",
-      done: true,
-    },
+    {},
     {
       id: 3,
killedBy: recommendationRequestFixtures has expected threeRecommendationRequests
statusReason: expected [ Array(3) ] to deeply equal [ { id: 1, …(6) }, …(2) ]

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:29:13
       explanation: "I need a letter for a scholarship application.",
       dateRequested: "2026-05-02T10:30:00",
       dateNeeded: "2026-05-20T23:59:00",
-      done: true,
+      done: false,
     },
     {
killedBy: recommendationRequestFixtures has expected threeRecommendationRequests
statusReason: expected [ { id: 1, …(6) }, …(2) ] to deeply equal [ { id: 1, …(6) }, …(2) ]

[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:31:5
       dateNeeded: "2026-05-20T23:59:00",
       done: true,
     },
-    {
-      id: 3,
-      requesterEmail: "student3@ucsb.edu",
-      professorEmail: "professor3@ucsb.edu",
-      explanation: "I am requesting a recommendation for a research position.",
-      dateRequested: "2026-05-03T13:15:00",
-      dateNeeded: "2026-06-15T12:00:00",
-      done: false,
-    },
+    {},
   ],
 };
killedBy: recommendationRequestFixtures has expected threeRecommendationRequests
statusReason: expected [ Array(3) ] to deeply equal [ { id: 1, …(6) }, …(2) ]

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:38:13
       explanation: "I am requesting a recommendation for a research position.",
       dateRequested: "2026-05-03T13:15:00",
       dateNeeded: "2026-06-15T12:00:00",
-      done: false,
+      done: true,
     },
   ],
killedBy: recommendationRequestFixtures has expected threeRecommendationRequests
statusReason: expected [ { id: 1, …(6) }, …(2) ] to deeply equal [ { id: 1, …(6) }, …(2) ]
