[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-      requestTime: helpRequest.requestTime,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 3 requester: ExampleNew@testing.edu",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `Help Request Updated - id: ${helpRequest.id} requester: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
