[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewCreatePage.jsx:8:52
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosParams = (menuItemReview) => ({});
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New menu item review Created - id: 3 itemId: 1",
