[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:22:31
     null,
   );
 
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests Changes when you click Update
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:11
     params: {
       id,
     },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
+    data: {},
   });
 
killedBy: RecommendationRequestEditPage tests Changes when you click Update
statusReason: expected {} to deeply equal { …(6) }

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={recommendationRequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
