[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:27:10
     <BasicLayout>
       <div className="pt-2">
         <h1>RecommendationRequests</h1>
-        {hasRole(currentUser, "ROLE_ADMIN") && (
-          <Button as={Link} to="/recommendationrequest/create">
-            Create RecommendationRequest
-          </Button>
-        )}
+        {true}
         <RecommendationRequestTable
           recommendationRequests={recommendationRequests}
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create RecommendationRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:27:10
     <BasicLayout>
       <div className="pt-2">
         <h1>RecommendationRequests</h1>
-        {hasRole(currentUser, "ROLE_ADMIN") && (
-          <Button as={Link} to="/recommendationrequest/create">
-            Create RecommendationRequest
-          </Button>
-        )}
+        {false}
         <RecommendationRequestTable
           recommendationRequests={recommendationRequests}
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create RecommendationRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
