[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItem.name,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Chicken Tacos",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:66
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItem.name,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({});
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Chicken Tacos",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:31:10
   );
 
   const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Chicken Tacos",

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {ucsbDiningCommonsMenuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={ucsbDiningCommonsMenuItem}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {ucsbDiningCommonsMenuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={ucsbDiningCommonsMenuItem}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
