[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganization",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO edited",

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:28:57
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganization",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbOrganization) => ({});
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO edited",

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbOrganization}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
