[Killed] BlockStatement
src/main/utils/recommendationRequestUtils.js:5:47
   console.log(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: { id: cell.row.original.id },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/recommendationRequestUtils.js:6:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: { id: cell.row.original.id },
-  };
+  return {};
 }
 
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/recommendationRequestUtils.js:9:13
   return {
     url: "/api/recommendationrequest",
     method: "DELETE",
-    params: { id: cell.row.original.id },
+    params: {},
   };
 }
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: expected {} to deeply equal { id: 1 }
